Repository: tobagin/keymaker
Catalog: po/*.po
Languages: es

source: Public key copied to clipboard
es: Clave pública copiada al portapapeles

source: Unable to copy public key to clipboard
es: No se pudo copiar la clave pública al portapapeles

source: Error details: {error} This might happen if: • The public key file is missing or corrupted • The clipboard system is not available • File permissions prevent reading the key
es: Detalles del error: {error} Esto puede suceder si: • El archivo de clave pública falta o está corrupto • El sistema de portapapeles no está disponible • Los permisos de archivo impiden leer la clave

source: Delete SSH Key?
es: ¿Eliminar clave SSH?

source: Are you sure you want to delete the key '{keyname}'?
es: ¿Estás seguro de que quieres eliminar la clave '{keyname}'?

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

source: Unable to load SSH keys
es: No se pudieron cargar las claves SSH

source: Error details: {error} This might happen if: • The ~/.ssh directory doesn't exist or has wrong permissions • Some key files are corrupted or have incorrect format • Insufficient permissions to read key files Try refreshing or check your SSH directory permissions.
es: Detalles del error: {error} Esto puede suceder si: • El directorio ~/.ssh no existe o tiene permisos incorrectos • Algunos archivos de claves están corruptos o tienen formato incorrecto • Permisos insuficientes para leer archivos de claves Intenta actualizar o verifica los permisos de tu directorio SSH.

source: Unable to delete SSH key
es: No se pudo eliminar la clave SSH

source: Error details: {error} This might happen if: • Insufficient permissions to delete the key files • The key files are currently in use • File system is read-only Try checking file permissions or closing any applications that might be using the key.
es: Detalles del error: {error} Esto puede suceder si: • Permisos insuficientes para eliminar los archivos de claves • Los archivos de claves están actualmente en uso • El sistema de archivos es de solo lectura Intenta verificar los permisos de archivo o cerrar aplicaciones que puedan estar usando la clave.

source: Unable to generate SSH key
es: No se pudo generar la clave SSH

source: SSH key already exists
es: La clave SSH ya existe

source: A key with this filename already exists. Please choose a different filename or delete the existing key first.
es: Ya existe una clave con este nombre de archivo. Por favor, elige un nombre diferente o elimina la clave existente primero.

source: Permission denied
es: Permiso denegado

source: Key Maker doesn't have permission to create files in the SSH directory. Please check that ~/.ssh directory exists and has proper permissions (700).
es: Key Maker no tiene permisos para crear archivos en el directorio SSH. Por favor, verifica que el directorio ~/.ssh existe y tiene los permisos apropiados (700).

source: SSH tools not available
es: Herramientas SSH no disponibles

source: The ssh-keygen command is not available on your system. Please install OpenSSH client tools.
es: El comando ssh-keygen no está disponible en tu sistema. Por favor, instala las herramientas cliente de OpenSSH.

source: Invalid key parameters
es: Parámetros de clave inválidos

source: The key generation parameters are invalid. Please check the filename and other settings.
es: Los parámetros de generación de claves son inválidos. Por favor, verifica el nombre de archivo y otras configuraciones.

source: This might happen if: • The ~/.ssh directory doesn't exist or has wrong permissions • OpenSSH tools are not installed • Insufficient disk space • The filename contains invalid characters
es: Esto puede suceder si: • El directorio ~/.ssh no existe o tiene permisos incorrectos • Las herramientas OpenSSH no están instaladas • Espacio en disco insuficiente • El nombre de archivo contiene caracteres inválidos

source: SSH Key Management
es: Gestión de Claves SSH

source: Manage SSH keys with a user-friendly graphical interface
es: Gestiona claves SSH con una interfaz gráfica fácil de usar

source: SSH;key;cryptography;security;authentication;
es: SSH;clave;criptografía;seguridad;autenticación;

source: SSH Key Management Application
es: Aplicación de Gestión de Claves SSH

source: Enable verbose logging
es: Habilitar registro detallado

source: A modern SSH key management application built with GTK4 and LibAdwaita
es: Una aplicación moderna de gestión de claves SSH construida con GTK4 y LibAdwaita
